AmbiqAI/nnse/evb/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_otpinfoc.h
// SBL_RPROT7 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_OTP_INFOC_SBL_RPROT7_CHUNKS_S 0
#define AM_REG_OTP_INFOC_SBL_RPROT7_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_SBL_RPROT7_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_SBL_RPROT7_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_SBL_RPROT7_CHUNKS_Msk 0xFFFFFFFF

// DCU_DISABLEOVERRIDE - This 32-bit word contains the DCU override configuration.
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_QUALIFIED_DCU_S 0
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_QUALIFIED_DCU_M 0x001FFFFF
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_QUALIFIED_DCU(n) (((uint32_t)(n) << 0) & 0x001FFFFF)
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_QUALIFIED_DCU_Pos 0
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_QUALIFIED_DCU_Msk 0x001FFFFF

// SEC_POL - OEM/customer security policy.
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENF_ECC_S 29
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENF_ECC_M 0xE0000000
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENF_ECC(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENF_ECC_Pos 29
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENF_ECC_Msk 0xE0000000
#define AM_REG_OTP_INFOC_SEC_POL_ENC_ENFORCE_S 26
#define AM_REG_OTP_INFOC_SEC_POL_ENC_ENFORCE_M 0x1C000000
#define AM_REG_OTP_INFOC_SEC_POL_ENC_ENFORCE(n) (((uint32_t)(n) << 26) & 0x1C000000)
#define AM_REG_OTP_INFOC_SEC_POL_ENC_ENFORCE_Pos 26
#define AM_REG_OTP_INFOC_SEC_POL_ENC_ENFORCE_Msk 0x1C000000
#define AM_ENUM_OTP_INFOC_SEC_POL_ENC_ENFORCE_Disabled          0x5  // No Decryption for OTA Updates.
#define AM_ENUM_OTP_INFOC_SEC_POL_ENC_ENFORCE_Enabled           0x2  // Decryption required for OTA Updates.
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENFORCE_S 23
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENFORCE_M 0x03800000
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENFORCE(n) (((uint32_t)(n) << 23) & 0x03800000)
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENFORCE_Pos 23
#define AM_REG_OTP_INFOC_SEC_POL_AUTH_ENFORCE_Msk 0x03800000
#define AM_ENUM_OTP_INFOC_SEC_POL_AUTH_ENFORCE_Disabled         0x5  // No Authentication for OTA Updates.
#define AM_ENUM_OTP_INFOC_SEC_POL_AUTH_ENFORCE_Enabled          0x2  // Authentication required for OTA Updates.
#define AM_REG_OTP_INFOC_SEC_POL_SBL_SWO_PIN_S 0
#define AM_REG_OTP_INFOC_SEC_POL_SBL_SWO_PIN_M 0x000000FF
#define AM_REG_OTP_INFOC_SEC_POL_SBL_SWO_PIN(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_OTP_INFOC_SEC_POL_SBL_SWO_PIN_Pos 0
#define AM_REG_OTP_INFOC_SEC_POL_SBL_SWO_PIN_Msk 0x000000FF

// BOOT_OVERRIDE - This 32-bit word contains the boot override configuration.
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_ENABLE_S 9
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_ENABLE_M 0x00000200
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_ENABLE(n) (((uint32_t)(n) << 9) & 0x00000200)
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_ENABLE_Pos 9
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_ENABLE_Msk 0x00000200
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_POL_S 8
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_POL_M 0x00000100
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_POL(n) (((uint32_t)(n) << 8) & 0x00000100)
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_POL_Pos 8
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_POL_Msk 0x00000100
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_GPIO_S 0
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_GPIO_M 0x000000FF
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_GPIO(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_GPIO_Pos 0
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_GPIO_Msk 0x000000FF

// WIRED_CONFIG - This 32-bit word contains the configuration for Wired Updates.
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2CADDR_S 18
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2CADDR_M 0x01FC0000
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2CADDR(n) (((uint32_t)(n) << 18) & 0x01FC0000)
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2CADDR_Pos 18
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2CADDR_Msk 0x01FC0000
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UARTMODULE_S 16
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UARTMODULE_M 0x00030000
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UARTMODULE(n) (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UARTMODULE_Pos 16
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UARTMODULE_Msk 0x00030000
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SLAVEINTPIN_S 3
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SLAVEINTPIN_M 0x000007F8
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SLAVEINTPIN(n) (((uint32_t)(n) << 3) & 0x000007F8)
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SLAVEINTPIN_Pos 3
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SLAVEINTPIN_Msk 0x000007F8
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2C_S 2
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2C_M 0x00000004
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2C(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2C_Pos 2
#define AM_REG_OTP_INFOC_WIRED_CONFIG_I2C_Msk 0x00000004
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SPI_S 1
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SPI_M 0x00000002
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SPI(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SPI_Pos 1
#define AM_REG_OTP_INFOC_WIRED_CONFIG_SPI_Msk 0x00000002
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UART_S 0
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UART_M 0x00000001
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UART(n) (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UART_Pos 0
#define AM_REG_OTP_INFOC_WIRED_CONFIG_UART_Msk 0x00000001

// CUST_WPROT0 - These bits write-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_WPROT0_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_WPROT0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_WPROT0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_WPROT0_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_WPROT0_CHUNKS_Msk 0xFFFFFFFF

// CUST_WPROT1 - These bits write-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_WPROT1_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_WPROT1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_WPROT1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_WPROT1_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_WPROT1_CHUNKS_Msk 0xFFFFFFFF

