AmbiqAI/nnse/evb/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_otpinfoc.h
// KEYBANK_CUST_QUADRANT0_KEY1 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_KEYBANK_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_KEYBANK_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_KEYBANK(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_KEYBANK_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_KEYBANK_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY2 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_KEYBANK_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_KEYBANK_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_KEYBANK(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_KEYBANK_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_KEYBANK_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY3 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_KEYBANK_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_KEYBANK_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_KEYBANK(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_KEYBANK_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_KEYBANK_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY4 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_KEYBANK_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_KEYBANK_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_KEYBANK(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_KEYBANK_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_KEYBANK_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY5 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY6 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY7 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY8 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY9 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY10 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY11 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY12 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY13 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY14 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY15 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY0 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY1 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_KEY_Msk 0xFFFFFFFF

