AmbiqAI/nnse/evb/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_otpinfoc.h
// KEYBANK_CUST_QUADRANT3_KEY1 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY2 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY3 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY4 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY5 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY6 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY7 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY8 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY9 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY10 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY11 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY12 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY13 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY14 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY15 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_Msk 0xFFFFFFFF

// SHDW_TRIM_INFO0_SEL - Shadow trim INFO0 Select. If this 32bits field has odd number of 1, the shadow trim Info 0 is copied from OTP; even number of 1, the shadow trim Info 0 is copied from MRAM.
#define AM_REG_OTP_INFOC_SHDW_TRIM_INFO0_SEL_TRIM_SEL_S 0
#define AM_REG_OTP_INFOC_SHDW_TRIM_INFO0_SEL_TRIM_SEL_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_SHDW_TRIM_INFO0_SEL_TRIM_SEL(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_SHDW_TRIM_INFO0_SEL_TRIM_SEL_Pos 0
#define AM_REG_OTP_INFOC_SHDW_TRIM_INFO0_SEL_TRIM_SEL_Msk 0xFFFFFFFF

#endif
